# font
cask "font-hackgen-nerd"
cask "font-moralerspace"

# cli
brew "git"
brew "tmux"
brew "mise"
brew "bat"
brew "fd"
brew "gsed"
brew "terminal-notifier"

# editor
brew "neovim"
cask "visual-studio-code"
cask "zed"

# application
cask "chatgpt-atlas"
cask "google-chrome"
cask "azooKey"
cask "1password"
cask "heptabase"
cask "readdle-spark"
cask "reader" # Readwise Reader
cask "docker-desktop"
cask "karabiner-elements"
cask "raycast"
cask "kobo"
cask "chatgpt"
cask "claude"
cask "codex-app"

# terminal
brew "starship"
cask "ghostty"

# other
brew "mas"

# vscode
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "vscodevim.vim"

# for app store
mas "LINE", id: 539883307
mas "Pixelmator Pro", id: 1289583905
