# font
cask "font-hackgen-nerd"

# cli
brew "tmux"
brew "mise"
brew "bat"

# editor
brew "neovim"
cask "visual-studio-code"

# application
cask "google-chrome"
cask "google-japanese-ime"
cask "1password"
cask "heptabase"
cask "readdle-spark"
cask "reader" # Readwise Reader
cask "docker-desktop"
cask "karabiner-elements"
cask "deepl"
cask "raycast"
cask "kobo"
cask "claude"
cask "chatgpt"

# terminal
brew "starship"
cask "ghostty"

# other
brew "mas"

# vscode
vscode "MS-CEINTL.vscode-language-pack-ja"

# for app store
mas "kindle", id: 302584613
mas "LINE", id: 539883307
mas "Pixelmator Pro", id: 1289583905
