# font
cask "font-hackgen-nerd"

# cli
brew "mise"

# editor
brew "neovim"
cask "visual-studio-code"

# application
cask "google-chrome"
cask "google-japanese-ime"
cask "1password"
cask "heptabase"
cask "readdle-spark"
cask "reader" # Readwise Reader
cask "docker"
cask "karabiner-elements"
cask "deepl"
cask "raycast"
cask "kobo"

# terminal
cask "ghostty"

# other
brew "mas"

# for app store
mas "kindle", id: 302584613
mas "LINE", id: 539883307
